In [4]:
import pandas as pd
tertiary_raw = pd.read_csv("../data/tertiary.csv")
tertiary_raw.head()

,Reference Area,Time Period,Sex,Age group,Units of measurement,Observation Value
0,Afghanistan,2014,Female,Not applicable,Percent,20.39494
1,Afghanistan,2014,Female,Not applicable,Number,53613.00000
2,Afghanistan,2014,All genders,Not applicable,Number,262874.00000
3,Afghanistan,2011,Female,Not applicable,Percent,24.26772
4,Afghanistan,2011,All genders,Not applicable,Number,97504.00000

In [5]:
print(tertiary_raw.shape)
print(tertiary_raw.columns)
tertiary_raw.info()

(15371, 6)
Index(['Reference Area', 'Time Period', 'Sex', 'Age group',
       'Units of measurement', 'Observation Value'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15371 entries, 0 to 15370
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Reference Area        15371 non-null  object
 1   Time Period           15371 non-null  int64
 2   Sex                   15371 non-null  object
 3   Age group             15371 non-null  object
 4   Units of measurement  15371 non-null  object
 5   Observation Value     15371 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 720.6+ KB

In [6]:
print(tertiary_raw["Sex"].value_counts(dropna=False))
print(tertiary_raw["Age group"].value_counts(dropna=False))
print(tertiary_raw["Units of measurement"].value_counts(dropna=False))

Sex
Female         9503
All genders    5868
Name: count, dtype: int64
Age group
Not applicable    15371
Name: count, dtype: int64
Units of measurement
Number     10944
Percent     4427
Name: count, dtype: int64

In [11]:
tertiary = tertiary_raw.copy()
tertiary = tertiary.rename(columns={"Reference Area": "Country","Time Period":"Year","Observation Value":"Value"})

tertiary.head()

,Country,Year,Sex,Age group,Units of measurement,Value
0,Afghanistan,2014,Female,Not applicable,Percent,20.39494
1,Afghanistan,2014,Female,Not applicable,Number,53613.00000
2,Afghanistan,2014,All genders,Not applicable,Number,262874.00000
3,Afghanistan,2011,Female,Not applicable,Percent,24.26772
4,Afghanistan,2011,All genders,Not applicable,Number,97504.00000

In [12]:


# filter to all genders 
tertiary = tertiary[tertiary["Sex"] == "All genders"].copy()

# drop columns that are no longer useful
tertiary = tertiary.drop(columns=["Sex", "Age group", "Units of measurement"])

# convert Year and Value to numeric
tertiary["Year"] = pd.to_numeric(tertiary["Year"], errors="coerce")
tertiary["Value"] = pd.to_numeric(tertiary["Value"], errors="coerce")

# drop missing essentials
tertiary = tertiary.dropna(subset=["Country", "Year", "Value"]).copy()
tertiary["Year"] = tertiary["Year"].astype(int)

# clean country names
tertiary["Country"] = tertiary["Country"].astype(str).str.strip()

# rename Value to meaningful name
tertiary = tertiary.rename(columns={"Value": "Enroll_Tertiary"})

In [13]:
print(tertiary.shape)
print(tertiary["Year"].min(), tertiary["Year"].max())
print("Duplicate Country-Year:",
      tertiary.duplicated(subset=["Country","Year"]).sum())

tertiary.head()

(5868, 3)
1975 2015
Duplicate Country-Year: 0

        Country  Year  Enroll_Tertiary
2   Afghanistan  2014         262874.0
4   Afghanistan  2011          97504.0
8   Afghanistan  2009          95185.0
10  Afghanistan  2004          27648.0
14  Afghanistan  2003          26211.0

In [14]:
tertiary.to_csv("../output/tertiary_clean.csv", index=False)